#ifndef keyboard_H
#define keyboard_H
//
//-------------------------------------------------------------
//
//
#include <main.h>
//
//-------------------------------------------------------------
//
//
extern uint32_t timeOfLastClick; // время с последнего нажатия
extern _Bool displayOn; //Флаг, дисплей вкл/выкл
//
//-------------------------------------------------------------
//
//
void KEYBOARD_ButtonClick(void);
//
//-------------------------------------------------------------
//
//
#endif
